Revit 2027 API
ScheduleField.ParameterId Property
 The ID of the parameter displayed by the field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ParameterId { get; }
Public ReadOnly Property ParameterId As ElementId
	Get
public:
property ElementId^ ParameterId {
	ElementId^ get ();
}
member ParameterId : ElementId with get
Property Value
ElementId
Remarks
 Most field types require a parameter ID. Count, Formula, and Percentage fields don't have parameter IDs.
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace